<script setup lang="ts"></script>

<template>
  <h1>ครื่องคำนวณหาค่าดัชนีมวลกาย (BMI)</h1>
  <p>
    การหาค่าดัชนีมวลกาย (Body Mass Index : BMI)
    คือเป็นมาตรการที่ใช้ประเมินภาวะอ้วนและผอมในผู้ใหญ่ ตั้งแต่อายุ 20 ปีขึ้นไป
    สามารถทำได้โดยการชั่งน้ำหนักตัวเป็นกิโลกรัม และวัดส่วนสูงเป็นเซนติเมตร
    แล้วนำมาหาดัชมีมวลกาย โดยใช้โปรแกรมวัดค่าความอ้วนข้างต้น
  </p>
  <div>
    <label for="weight">น้ำหนักตัว (kg.)</label>
    <input id="weight" />
  </div>
  <div>
    <label for="height">ส่วนสูง (cm.)</label>
    <input id="height" />
  </div>
  <div>
    <button>คำนวณ</button>
  </div>

  <table>
    <tr>
      <th>BMI kg/m2</th>
      <th>อยู่ในเกณท์</th>
      <th>ภาวะเสี่ยงต่อโรค</th>
    </tr>
    <tr>
      <td>น้อยกว่า 18.50</td>
      <td>น้ำหนักน้อย / ผอม</td>
      <td>มากกว่าคนปกติ</td>
    </tr>
    <tr>
      <td>ระหว่าง 18.50 - 22.90</td>
      <td>น้ำหนักน้อย / ผอม</td>
      <td>เท่าคนปกติ</td>
    </tr>
    <tr>
      <td>ระหว่าง 23 - 24.90</td>
      <td>ท้วม / โรคอ้วนระดับ 1</td>
      <td>อันตรายระดับ 1</td>
    </tr>
    <tr>
      <td>ระหว่าง 25 - 29.90</td>
      <td>อ้วน / โรคอ้วนระดับ 2</td>
      <td>อันตรายระดับ 2</td>
    </tr>
    <tr>
      <td>มากกว่า 30</td>
      <td>อ้วนมาก / โรคอ้วนระดับ 3</td>
      <td>อันตรายระดับ 3</td>
    </tr>
  </table>
</template>

<style scoped></style>
